Revit 2026 API

# RebarFreeFormAccessorSetLayoutAsMaximumSpacing Method

---

Sets the Layout Rule property of rebar set to Maximum Spacing.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutAsMaximumSpacing(
	double spacing
)
```
```vb
Public Sub SetLayoutAsMaximumSpacing (
	spacing As Double
)
```
```cpp
public:
void SetLayoutAsMaximumSpacing(
	double spacing
)
```
```fsharp
member SetLayoutAsMaximumSpacing :
        spacing : float -> unit
```

#### Parameters

spacing Double
     The maximum spacing of bars in set.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace